[
  {
    "name": "Britt Green",
    "title": "Pastor",
    "bio": "A native of Union Springs, AL, Britt came to faith in Christ at the age of 21, and followed God's call to vocational ministry later in the same year. He has served four churches in Alabama and Florida, and earned academic degrees from New Orleans and Southeastern Baptist Theological Seminaries. Britt and his wife Heather have four children (Caleb, Eli, Matthew, and Mary-Lynn). God called the Greens to Eclectic in January of 2011, and has shown grace after grace to them in this family of faith. Britt enjoys spending time with family, college football (War Eagle!), and the great outdoors.",
    "shortBio": "A native of Union Springs, AL, Britt came to faith in Christ at the age of 21, and followed God's call to vocational ministry later in the same year...",
    "image": "https://psides83.github.io/listJSON/britt-green.png"
  },
  {
    "name": "Jeremy Brown",
    "title": "Associate Pastor of Family Ministry",
    "bio": "Jeremy spent five and a half years on staff with FBCE before moving to Birmingham to complete his Master's of Divinity at Beeson Divinity School. He rejoined our staff in 2018, overseeing ministry to families. Jeremy is passionate about equipping the the church through prayer, preaching, and family discipleship. He enjoys spending time with his wife LaShelia, son Avery, and daughter Analeigh.",
    "shortBio": "Jeremy spent five and a half years on staff with FBCE before moving to Birmingham to complete his Master's of Divinity at Beeson Divinity School...",
    "image": "https://psides83.github.io/listJSON/jeremy-brown.jpg"
  },
  {
    "name": "Kyle Futral",
    "title": "Worship Pastor",
    "bio": "Kyle is a native of Eclectic and long-time member of First Baptist. He became our worship pastor in the spring of 2015, and has been passionately leading us in worship through music ever since. In addition to his leadership in the church, Kyle is a high school principal. He and his wife Malarie have two small boys, Baron and Ben.",
    "shortBio": "Kyle is a native of Eclectic and long-time member of First Baptist. He became our worship pastor in the spring of 2015...",
    "image": "https://psides83.github.io/listJSON/kyle-futral.png"
  },
  {
    "name": "Robin Studdard",
    "title": "Office Administrator",
    "bio": "Robin grew up in Eclectic where she has raised four children (Halie, Jake, Brooke, and Gavin) with her husband Greg. Robin has served as our church administrator since 2001. When she is not engaging in daily church office matters or occasional practical jokes, Robin enjoys spending time with her granddaughters Kinsley, Saylor, and friends.",
    "shortBio": "Robin grew up in Eclectic where she has raised four children (Halie, Jake, Brooke, and Gavin) with her husband Greg...",
    "image": "https://psides83.github.io/listJSON/robin-studdard.jpg"
  },
  {
    "name": "Marlo Wilks",
    "title": "Financial Secretary",
    "bio": "Marlo has been a resident of Eclectic since 2006 and has served as the church financial secretary since 2007. She has been married to her husband Jack for 26 years and has an adult son named Lyle. In her spare time, Marlo enjoys spending time on Lake Martin with her family and friends.",
    "shortBio": "Marlo has been a resident of Eclectic since 2006 and has served as the church financial secretary since 2007...",
    "image": "https://psides83.github.io/listJSON/marlo-wilks.jpg"
  }
]
