{
  "title": "Church Covenant",
  "paragraphs": [
    "Individually, we will cultivate intimacy with God and pursue personal holiness by regularly practicing the spiritual disciplines including prayer and Bible reading. Corporately, we will delight in God and His grace through musical worship, the preached Word, fellowship, and the taking of communion.",
    "We will nurture the health of the body by regularly encouraging, praying for, and serving one another indiscriminately. We will guard the purity of the body by living a life worthy of the Gospel. We will support the ministry of the body by giving generously of our time, talents, and treasures. We will advance the mission of the body by proclaiming the Gospel to the lost and underprivileged by word and deed. We will promote the unity of the body by humbly and gently confronting one another’s sin, resolving conflict biblically, and guarding our speech to ensure that it is edifying and full of grace.",
    "Together, we will guard the sanctity of marriage—designed by God to be a lifelong covenant union between one man and one woman—as a witness to Christ’s unconditional commitment to His church. We will view children as a blessing and heritage from God and guard the sanctity of human life. Understanding that parents are primarily responsible for the discipleship and spiritual formation of their children, we will strive to cultivate homes and families that treasure the Son of God, study the Word of God, and live for the glory of God.",
    "Understanding the loving and restorative nature of church discipline, we will humbly and joyfully submit ourselves to receive correction in accordance with the New Testament’s prescription for church discipline and reconciliation.",
    "Together, we will follow the leadership of the pastor and pastoral staff whom God has entrusted to serve and care for our church, teach the Word, and model the character of Christ before us. While affirming the Baptist Faith and Message as a faithful confession, we recognize the Bible alone as the inspired and inerrant Word of God, and submit to it as the final authority on all matters.",
    "As a member church of the Southern Baptist Convention, we recognize the{' '} <a href='/what-we-teach' rel='noreferrer'> Baptist Faith and Message (2000) </a>{' '} as our official doctrinal statement."
  ]
}
